<template>
    <div class="container container text-center landing-details mb-4">
        <h1 class="landing-title ff-handwrite">Дресс-код</h1>
        <p class="mb-4">
            Мы трепетно подошли к организации нашего свадебного вечера, поэтому
            просим вас подобрать коктейльные платья и костюмы в соответствии с
            цветовой гаммой нашего дресс-кода:
        </p>
        <div
            class="btn-flex justify-content-center landing-details-colors px-3 mb-3"
        >
            <div
                v-for="backgroundColor in [
                    '#FFDDD4',
                    '#FEBC5B',
                    '#FD7A2A',
                    '#D7168B',
                    '#E77877',
                    '#CFB898',
                    '#627059',
                ]"
                :style="{ backgroundColor }"
                class="h-100 flex-grow-1"
            ></div>
        </div>

        <h1 class="landing-title ff-handwrite">Важные детали</h1>

        <ul class="text-start">
            <li>
                Если вы желаете подарить цветы, то нам будет приятно получить их
                в коробках или корзинах, так они смогут порадовать нас дольше.
            </li>
            <li>
                Просим не обременять себя выбором подарка, ваши пожелания в
                конвертах помогут осуществить нам нашу мечту.
            </li>
            <li>
                Обратите внимание, что и формат мероприятия не предполагают
                детской площадки и аниматоров. Пожалуйста, позаботьтесь о том,
                чтобы провести этот вечер без детей.
            </li>
            <li>
                В день свадьбы мы будем немного заняты, поэтому, в случае
                возникновения вопросов, вы всегда можете обратиться за помощью к
                нашему свадебному организатору Александре:
                <a href="tel:/+79132096264">+7 (913) 209-62-64</a>.
            </li>
        </ul>
    </div>
</template>
