<template>
    <div class="container container py-5 text-center">
        <h1>Детали</h1>
        <p>
            Мы трепетно подошли к организации нашего свадебного вечера, поэтому
            просим вас подобрать коктейльные платья и костюмы в соответствии с
            цветовой гаммой нашего дресс-кода:
        </p>
        <img src="/palette.webp" alt="Palette" class="img-fluid mb-3 px-5" />
        <p>
            Если вы желаете подарить цветы, то нам будет приятно получить их в
            коробках или корзинах, так они смогут порадовать нас дольше.
        </p>
        <p>
            Просим не обременять себя выбором подарка, ваши пожелания в
            конвертах помогут осуществить нам нашу мечту.
        </p>
        <p>
            Обратите внимание, что и формат мероприятия не предполагают детской
            площадки и аниматоров. Пожалуйста, позаботьтесь о том, чтобы
            провести этот вечер без детей.
        </p>
        <p>
            В день свадьбы мы будем немного заняты, поэтому, в случае
            возникновения вопросов, вы всегда можете обратиться за помощью к
            нашему свадебному организатору Александре:
            <a href="tel:/+79132096264">+7 (913) 209-62-64</a>.
        </p>
    </div>
</template>
